Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz4010ca90100.h
#define PIN_PD03D_SERCOM3_PAD0                     _UINT32_(99)
#define MUX_PD03D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD03D_SERCOM3_PAD0                  ((PIN_PD03D_SERCOM3_PAD0 << 16) | MUX_PD03D_SERCOM3_PAD0)
#define PORT_PD03D_SERCOM3_PAD0                    (_UINT32_(1) << 3)

#define PIN_PC13D_SERCOM3_PAD1                     _UINT32_(77)
#define MUX_PC13D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM3_PAD1                  ((PIN_PC13D_SERCOM3_PAD1 << 16) | MUX_PC13D_SERCOM3_PAD1)
#define PORT_PC13D_SERCOM3_PAD1                    (_UINT32_(1) << 13)

#define PIN_PD04D_SERCOM3_PAD1                     _UINT32_(100)
#define MUX_PD04D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PD04D_SERCOM3_PAD1                  ((PIN_PD04D_SERCOM3_PAD1 << 16) | MUX_PD04D_SERCOM3_PAD1)
#define PORT_PD04D_SERCOM3_PAD1                    (_UINT32_(1) << 4)

#define PIN_PC14D_SERCOM3_PAD2                     _UINT32_(78)
#define MUX_PC14D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PC14D_SERCOM3_PAD2                  ((PIN_PC14D_SERCOM3_PAD2 << 16) | MUX_PC14D_SERCOM3_PAD2)
#define PORT_PC14D_SERCOM3_PAD2                    (_UINT32_(1) << 14)

#define PIN_PD05D_SERCOM3_PAD2                     _UINT32_(101)
#define MUX_PD05D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PD05D_SERCOM3_PAD2                  ((PIN_PD05D_SERCOM3_PAD2 << 16) | MUX_PD05D_SERCOM3_PAD2)
#define PORT_PD05D_SERCOM3_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC15D_SERCOM3_PAD3                     _UINT32_(79)
#define MUX_PC15D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM3_PAD3                  ((PIN_PC15D_SERCOM3_PAD3 << 16) | MUX_PC15D_SERCOM3_PAD3)
#define PORT_PC15D_SERCOM3_PAD3                    (_UINT32_(1) << 15)

#define PIN_PD06D_SERCOM3_PAD3                     _UINT32_(102)
#define MUX_PD06D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM3_PAD3                  ((PIN_PD06D_SERCOM3_PAD3 << 16) | MUX_PD06D_SERCOM3_PAD3)
#define PORT_PD06D_SERCOM3_PAD3                    (_UINT32_(1) << 6)

/* ========== PORT definition for SPI_IXS0 peripheral ========== */
#define PIN_PC00J_SPI_IXS0_FSYNC                   _UINT32_(64)
#define MUX_PC00J_SPI_IXS0_FSYNC                   _UINT32_(9) 
#define PINMUX_PC00J_SPI_IXS0_FSYNC                ((PIN_PC00J_SPI_IXS0_FSYNC << 16) | MUX_PC00J_SPI_IXS0_FSYNC)
#define PORT_PC00J_SPI_IXS0_FSYNC                  (_UINT32_(1) << 0)

#define PIN_PD02J_SPI_IXS0_FSYNC                   _UINT32_(98)
#define MUX_PD02J_SPI_IXS0_FSYNC                   _UINT32_(9) 
#define PINMUX_PD02J_SPI_IXS0_FSYNC                ((PIN_PD02J_SPI_IXS0_FSYNC << 16) | MUX_PD02J_SPI_IXS0_FSYNC)
#define PORT_PD02J_SPI_IXS0_FSYNC                  (_UINT32_(1) << 2)

#define PIN_PC01J_SPI_IXS0_SCK                     _UINT32_(65)
#define MUX_PC01J_SPI_IXS0_SCK                     _UINT32_(9) 
#define PINMUX_PC01J_SPI_IXS0_SCK                  ((PIN_PC01J_SPI_IXS0_SCK << 16) | MUX_PC01J_SPI_IXS0_SCK)
#define PORT_PC01J_SPI_IXS0_SCK                    (_UINT32_(1) << 1)

#define PIN_PD04J_SPI_IXS0_SCK                     _UINT32_(100)
#define MUX_PD04J_SPI_IXS0_SCK                     _UINT32_(9) 
#define PINMUX_PD04J_SPI_IXS0_SCK                  ((PIN_PD04J_SPI_IXS0_SCK << 16) | MUX_PD04J_SPI_IXS0_SCK)
#define PORT_PD04J_SPI_IXS0_SCK                    (_UINT32_(1) << 4)

#define PIN_PC02J_SPI_IXS0_SDI                     _UINT32_(66)
#define MUX_PC02J_SPI_IXS0_SDI                     _UINT32_(9) 
#define PINMUX_PC02J_SPI_IXS0_SDI                  ((PIN_PC02J_SPI_IXS0_SDI << 16) | MUX_PC02J_SPI_IXS0_SDI)
#define PORT_PC02J_SPI_IXS0_SDI                    (_UINT32_(1) << 2)

#define PIN_PD03J_SPI_IXS0_SDI                     _UINT32_(99)
#define MUX_PD03J_SPI_IXS0_SDI                     _UINT32_(9) 
#define PINMUX_PD03J_SPI_IXS0_SDI                  ((PIN_PD03J_SPI_IXS0_SDI << 16) | MUX_PD03J_SPI_IXS0_SDI)
#define PORT_PD03J_SPI_IXS0_SDI                    (_UINT32_(1) << 3)

#define PIN_PC03J_SPI_IXS0_SDO                     _UINT32_(67)
#define MUX_PC03J_SPI_IXS0_SDO                     _UINT32_(9) 
#define PINMUX_PC03J_SPI_IXS0_SDO                  ((PIN_PC03J_SPI_IXS0_SDO << 16) | MUX_PC03J_SPI_IXS0_SDO)
#define PORT_PC03J_SPI_IXS0_SDO                    (_UINT32_(1) << 3)

#define PIN_PD05J_SPI_IXS0_SDO                     _UINT32_(101)
#define MUX_PD05J_SPI_IXS0_SDO                     _UINT32_(9) 
#define PINMUX_PD05J_SPI_IXS0_SDO                  ((PIN_PD05J_SPI_IXS0_SDO << 16) | MUX_PD05J_SPI_IXS0_SDO)
#define PORT_PD05J_SPI_IXS0_SDO                    (_UINT32_(1) << 5)

/* ========== PORT definition for SQI0 peripheral ========== */
#define PIN_PC08H_SQI0_CLK                         _UINT32_(72)
#define MUX_PC08H_SQI0_CLK                         _UINT32_(7) 
#define PINMUX_PC08H_SQI0_CLK                      ((PIN_PC08H_SQI0_CLK << 16) | MUX_PC08H_SQI0_CLK)
#define PORT_PC08H_SQI0_CLK                        (_UINT32_(1) << 8)

#define PIN_PC13H_SQI0_CS0                         _UINT32_(77)
#define MUX_PC13H_SQI0_CS0                         _UINT32_(7) 
#define PINMUX_PC13H_SQI0_CS0                      ((PIN_PC13H_SQI0_CS0 << 16) | MUX_PC13H_SQI0_CS0)
#define PORT_PC13H_SQI0_CS0                        (_UINT32_(1) << 13)

#define PIN_PC15H_SQI0_CS1                         _UINT32_(79)
#define MUX_PC15H_SQI0_CS1                         _UINT32_(7) 
#define PINMUX_PC15H_SQI0_CS1                      ((PIN_PC15H_SQI0_CS1 << 16) | MUX_PC15H_SQI0_CS1)
#define PORT_PC15H_SQI0_CS1                        (_UINT32_(1) << 15)

#define PIN_PC09H_SQI0_DATA0                       _UINT32_(73)
#define MUX_PC09H_SQI0_DATA0                       _UINT32_(7) 
#define PINMUX_PC09H_SQI0_DATA0                    ((PIN_PC09H_SQI0_DATA0 << 16) | MUX_PC09H_SQI0_DATA0)
#define PORT_PC09H_SQI0_DATA0                      (_UINT32_(1) << 9)

#define PIN_PC10H_SQI0_DATA1                       _UINT32_(74)
#define MUX_PC10H_SQI0_DATA1                       _UINT32_(7) 
#define PINMUX_PC10H_SQI0_DATA1                    ((PIN_PC10H_SQI0_DATA1 << 16) | MUX_PC10H_SQI0_DATA1)
#define PORT_PC10H_SQI0_DATA1                      (_UINT32_(1) << 10)

#define PIN_PC11H_SQI0_DATA2                       _UINT32_(75)
#define MUX_PC11H_SQI0_DATA2                       _UINT32_(7) 
#define PINMUX_PC11H_SQI0_DATA2                    ((PIN_PC11H_SQI0_DATA2 << 16) | MUX_PC11H_SQI0_DATA2)
#define PORT_PC11H_SQI0_DATA2                      (_UINT32_(1) << 11)

#define PIN_PC12H_SQI0_DATA3                       _UINT32_(76)
#define MUX_PC12H_SQI0_DATA3                       _UINT32_(7) 
#define PINMUX_PC12H_SQI0_DATA3                    ((PIN_PC12H_SQI0_DATA3 << 16) | MUX_PC12H_SQI0_DATA3)
#define PORT_PC12H_SQI0_DATA3                      (_UINT32_(1) << 12)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PC00F_TCC0_WO0                         _UINT32_(64)
#define MUX_PC00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC00F_TCC0_WO0                      ((PIN_PC00F_TCC0_WO0 << 16) | MUX_PC00F_TCC0_WO0)
#define PORT_PC00F_TCC0_WO0                        (_UINT32_(1) << 0)

